{
    "subtitle": "Kalender der christlichen Feste & Heilige des Tages",
    "saintOfDay": "Heiliger des Tages",
    "searchYear": "Jahr suchen",
    "yearPlaceholder": "Jahr (-46 bis 9999)",
    "tabHolidays": "Feste",
    "tabSaints": "Heilige",
    "emptyHolidays": "Geben Sie ein Jahr ein, um christliche Feste zu sehen",
    "addToGoogle": "Zu Google Kalender hinzufügen",
    "legendMajor": "Hochfest",
    "legendMobile": "Bewegliches Fest",
    "legendFixed": "Festes Fest",
    "legendToday": "Heute",
    "legendSaint": "Heiliger des Tages",
    "footerTitle": "Christlicher Kalender",
    "legalNotice": "Impressum",
    "gdpr": "DSGVO",
    "footerCompliance": "Konform mit DSGVO (EU 2016/679) und Datenschutzgesetzen",
    "mon": "Mo",
    "tue": "Di",
    "wed": "Mi",
    "thu": "Do",
    "fri": "Fr",
    "sat": "Sa",
    "sun": "So",
    "months": ["Januar", "Februar", "März", "April", "Mai", "Juni", "Juli", "August", "September", "Oktober", "November", "Dezember"],
    "isLeapYear": "ist ein Schaltjahr",
    "isNotLeapYear": "ist kein Schaltjahr",
    "days366": "366 Tage - Februar hat 29 Tage",
    "days365": "365 Tage - Februar hat 28 Tage",
    "impossible": "Kann nicht gehen",
    "beforeYear": "vor 46 v. Chr.",
    "afterYear": "über Jahr 9999 hinaus",
    "enterValidYear": "Bitte geben Sie ein gültiges Jahr ein (-46 bis 9999)",
    "skippedDay": "Tag während der gregorianischen Reform entfernt",
    "churchCelebrates": "Die Kirche feiert",
    "eachDay": "Jeder Tag des Jahres ist dem Gedenken an einen oder mehrere Heilige gewidmet, die ihren Glauben durch ihr vorbildliches Leben bezeugt haben.",
    "donateBtn": "Spenden",
    "donateTitle": "Für die Kirche spenden",
    "donateDescription": "Ihre Unterstützung hilft, kirchliche Aktivitäten, Gebäudewartung und karitative Werke zu finanzieren.",
    "donateLinkText": "Spenden",
    "donateLinkUrl": "https://paypal.com",
    "close": "Schließen",
    "flag": "🇩🇪",
    
    "calendarPreJulian": "Vor-Julianisch (Römischer Kalender)",
    "calendarJulian": "Julianisch",
    "calendarTransition": "Übergang Julianisch → Gregorianisch",
    "calendarGregorianFirst": "Gregorianisch (1. vollständiges Jahr)",
    "calendarGregorian": "Gregorianisch",
    
    "leapRuleRoman": "Antikes römisches Kalendersystem",
    "leapRuleJulian": "Schaltjahr wenn durch 4 teilbar",
    "leapRuleTransition": "Übergangsjahr",
    "leapRuleGregorian": "Schaltjahr wenn durch 4 teilbar, außer Säkularjahre die nicht durch 400 teilbar sind",
    
    "descPreJulian": "Im {year} war der antike römische Kalender in Kraft. Der Julianische Kalender wird 45 v. Chr. eingeführt.",
    "descJulianBC": "Im {year} war der Julianische Kalender in Kraft. Eingeführt von Julius Cäsar 45 v. Chr.",
    "descJulianAD": "Im {year} war der Julianische Kalender in Kraft. Er wird 1582 reformiert.",
    "descTransition": "{year} ist das Jahr der Gregorianischen Reform! Papst Gregor XIII. strich 10 Tage: Man ging vom 4. Oktober zum 15. Oktober 1582.",
    "descGregorianFirst": "{year} ist das erste vollständige Jahr des Gregorianischen Kalenders. Der Unterschied zum Julianischen Kalender betrug damals 10 Tage.",
    "descGregorian": "Im {year} ist der Gregorianische Kalender in Kraft.",
    
    "easterGregorian": "Ostern (Gregorianisch)",
    "easterJulian": "Ostern (Julianisch)",
    "easterDaysDiff": "+{days} Tage",
    
    "noHolidaysBeforeYear0": "Keine christlichen Feste vor der Geburt Christi (25. Dezember Jahr 0)",
    
    "legalAndGdpr": "Impressum & DSGVO",
    "legalTitle": "Impressum & DSGVO",
    "legalSection1Title": "1. Herausgeber der Website",
    "legalSection1Text1": "GigaFaith - Christlicher Kalender",
    "legalSection1Text2": "Informative und pädagogische Webanwendung.",
    "legalSection2Title": "2. Hosting",
    "legalSection2Text": "Lokal gehostete / selbst gehostete Anwendung.",
    "legalSection3Title": "3. Schutz personenbezogener Daten (DSGVO)",
    "legalSection3Intro": "Gemäß der Datenschutz-Grundverordnung (DSGVO - EU 2016/679):",
    "legalSection3Item1": "Erhobene Daten: Diese Anwendung erhebt keine personenbezogenen Daten.",
    "legalSection3Item2": "Cookies: Es wird nur ein technisches Cookie verwendet, um Ihre Designeinstellungen (hell/dunkel) zu speichern. Dieses Cookie ist für den Betrieb der Website unbedingt erforderlich und bedarf keiner Einwilligung.",
    "legalSection3Item3": "LocalStorage: Das gewählte Design wird lokal in Ihrem Browser gespeichert.",
    "legalSection3Item4": "Datenübertragung: Keine Datenübertragung an Dritte.",
    "legalSection4Title": "4. Ihre Rechte (Artikel 15-22 DSGVO)",
    "legalSection4Intro": "Sie haben folgende Rechte:",
    "legalSection4Item1": "Recht auf Auskunft über Ihre Daten",
    "legalSection4Item2": "Recht auf Berichtigung",
    "legalSection4Item3": "Recht auf Löschung ('Recht auf Vergessenwerden')",
    "legalSection4Item4": "Recht auf Einschränkung der Verarbeitung",
    "legalSection4Item5": "Recht auf Datenübertragbarkeit",
    "legalSection4Item6": "Widerspruchsrecht",
    "legalSection4Note": "Hinweis: Diese Rechte gelten hier nicht, da keine personenbezogenen Daten erhoben werden.",
    "legalSection5Title": "5. Geistiges Eigentum",
    "legalSection5Text": "Informationen über christliche Feiertage und Heilige stammen aus dem öffentlichen Bereich und der katholischen Tradition.",
    "legalSection6Title": "6. Anwendbares Recht",
    "legalSection6Intro": "Diese Website unterliegt dem europäischen Recht, insbesondere:",
    "legalSection6Item1": "Datenschutz-Grundverordnung (EU) 2016/679",
    "legalSection6Item2": "Bundesdatenschutzgesetz (BDSG)",
    "legalSection6Item3": "Telemediengesetz (TMG)",
    "legalSection7Title": "7. Kontakt Datenschutzbehörde",
    "legalSection7Intro": "Bei Fragen zum Datenschutz können Sie sich an folgende Stelle wenden:",
    "legalSection7Authority": "Der Bundesbeauftragte für den Datenschutz und die Informationsfreiheit",
    "legalSection7Address": "Husarenstr. 30, 53117 Bonn",
    "legalSection7Website": "www.bfdi.bund.de",
    "legalUnderstood": "Verstanden",

    "holidayMaryMotherOfGod": "Maria, Mutter Gottes",
    "holidayMaryMotherOfGodDesc": "Am ersten Tag des Jahres feiert dieses Fest die göttliche Mutterschaft Marias. Sie ist die Mutter Jesu Christi, des Sohnes Gottes, der Mensch geworden ist. Dieses Hochfest ist auch der Weltfriedenstag.",
    "holidayEpiphany": "Erscheinung des Herrn",
    "holidayEpiphanyDesc": "Epiphanias feiert die Offenbarung Jesu vor den Weisen aus dem Morgenland. Diese Weisen, von einem Stern geführt, brachten dem Jesuskind Gold, Weihrauch und Myrrhe. Dieses Fest symbolisiert Gottes Offenbarung an alle Völker.",
    "holidayPresentation": "Darstellung des Herrn",
    "holidayPresentationDesc": "Vierzig Tage nach Weihnachten gedenkt dieses Fest der Darstellung Jesu im Tempel von Jerusalem durch Maria und Josef, gemäß dem jüdischen Gesetz. Es ist auch als Mariä Lichtmess bekannt.",
    "holidaySaintJoseph": "Heiliger Josef",
    "holidaySaintJosephDesc": "Fest des heiligen Josef, Ehemann der Jungfrau Maria und Nährvater Jesu. Er ist der Schutzpatron der Arbeiter, der Familienväter und der Universalkirche.",
    "holidayAnnunciation": "Verkündigung des Herrn",
    "holidayAnnunciationDesc": "Mariä Verkündigung feiert die Ankündigung des Erzengels Gabriel an Maria, dass sie die Mutter des Sohnes Gottes werden würde. Maria sagte 'Ja' zu Gott und ermöglichte so die Menschwerdung.",
    "holidayJohnBaptistBirth": "Geburt Johannes des Täufers",
    "holidayJohnBaptistBirthDesc": "Dieses Fest feiert die Geburt Johannes des Täufers, des Vorläufers Christi. Er bereitete den Weg des Herrn und taufte Jesus im Jordan.",
    "holidayPeterPaul": "Heilige Peter und Paul",
    "holidayPeterPaulDesc": "Ein Hochfest, das die zwei Säulen der Kirche feiert: Petrus, der Anführer der Apostel, dem Jesus die Schlüssel des Himmelreichs anvertraute, und Paulus, der Apostel der Völker, der die heidnische Welt evangelisierte.",
    "holidayTransfiguration": "Verklärung des Herrn",
    "holidayTransfigurationDesc": "Die Verklärung erinnert an den Moment, als Jesus auf dem Berg Tabor seine göttliche Herrlichkeit Petrus, Jakobus und Johannes offenbarte. Sein Gesicht strahlte wie die Sonne.",
    "holidayAssumption": "Mariä Himmelfahrt",
    "holidayAssumptionDesc": "Mariä Himmelfahrt feiert die Aufnahme der Jungfrau Maria mit Leib und Seele in den Himmel am Ende ihres irdischen Lebens. Sie war die Erste der Erlösten, die in die himmlische Herrlichkeit eintrat.",
    "holidayMaryBirth": "Mariä Geburt",
    "holidayMaryBirthDesc": "Dieses Fest feiert die Geburt Marias, die die Mutter Jesu werden sollte. Sie wurde ohne Erbsünde geboren, von Gott vorbereitet, die Mutter des Erlösers zu sein.",
    "holidayHolyCross": "Kreuzerhöhung",
    "holidayHolyCrossDesc": "Dieses Fest erhöht das Heilige Kreuz, das Werkzeug unserer Erlösung. Es erinnert an die Auffindung des Wahren Kreuzes durch die heilige Helena und den Sieg Christi über den Tod.",
    "holidayAllSaints": "Allerheiligen",
    "holidayAllSaintsDesc": "Allerheiligen ist das Fest aller Heiligen, bekannter und unbekannter, die im Paradies sind. Es erinnert uns daran, dass wir alle zur Heiligkeit und zum ewigen Leben mit Gott berufen sind.",
    "holidayAllSouls": "Allerseelen",
    "holidayAllSoulsDesc": "Am Tag nach Allerheiligen betet die Kirche für alle verstorbenen Gläubigen, die im Fegefeuer sind, damit sie gereinigt werden und in die Freude des Himmels eingehen können.",
    "holidayImmaculateConception": "Unbefleckte Empfängnis",
    "holidayImmaculateConceptionDesc": "Dieses Hochfest feiert die Empfängnis Marias ohne Erbsünde. Vom ersten Augenblick ihrer Existenz an wurde Maria vor der Sünde bewahrt, um die Mutter des Erlösers zu werden.",
    "holidayChristmas": "Weihnachten - Geburt des Herrn",
    "holidayChristmasDesc": "Weihnachten feiert die Geburt Jesu Christi in Bethlehem. Der Sohn Gottes wurde Mensch, um uns zu retten. Es ist das Fest der Liebe Gottes, der kommt, um unter uns zu wohnen.",
    "holidaySaintStephen": "Heiliger Stephanus",
    "holidaySaintStephenDesc": "Fest des ersten christlichen Märtyrers. Stephanus, ein Diakon voll des Heiligen Geistes, wurde für seinen Glauben an Jesus Christus gesteinigt. Er vergab seinen Peinigern wie Christus am Kreuz.",
    "holidaySaintJohn": "Heiliger Johannes der Evangelist",
    "holidaySaintJohnDesc": "Fest des Apostels Johannes, des Jüngers, den Jesus liebte. Er ist der Autor des vierten Evangeliums, dreier Briefe und der Offenbarung. Er ist der einzige Apostel, der eines natürlichen Todes starb.",
    "holidayHolyInnocents": "Unschuldige Kinder",
    "holidayHolyInnocentsDesc": "Dieses Fest erinnert an die Kinder von Bethlehem, die auf Befehl des Königs Herodes getötet wurden, der versuchte, das Jesuskind zu töten. Sie gelten als die ersten Märtyrer.",

    "holidayAshWednesday": "Aschermittwoch",
    "holidayAshWednesdayDesc": "Beginn der Fastenzeit, einer 40-tägigen Vorbereitungszeit auf Ostern. Die Asche, die auf die Stirn gezeichnet wird, erinnert uns an unsere Sterblichkeit und lädt uns zur Umkehr ein.",
    "holidayPalmSunday": "Palmsonntag",
    "holidayPalmSundayDesc": "Dieser Sonntag eröffnet die Karwoche und erinnert an den triumphalen Einzug Jesu in Jerusalem. Das Volk begrüßte ihn mit Palmzweigen und rief 'Hosanna!'",
    "holidayHolyThursday": "Gründonnerstag",
    "holidayHolyThursdayDesc": "Der Gründonnerstag erinnert an das letzte Abendmahl Jesu mit seinen Aposteln, bei dem er die Eucharistie und das Priestertum einsetzte. Er wusch auch die Füße seiner Jünger.",
    "holidayGoodFriday": "Karfreitag",
    "holidayGoodFridayDesc": "Der Karfreitag ist der Tag der Kreuzigung und des Todes Jesu am Kreuz. Es ist ein Tag des Fastens und Gebets, an dem die Kirche das Kreuz des Erlösers verehrt.",
    "holidayHolySaturday": "Karsamstag",
    "holidayHolySaturdayDesc": "Ein Tag der Stille und des Wartens zwischen dem Tod und der Auferstehung Christi. Die Kirche wacht am Grab. Die Osternacht feiert die Auferstehung.",
    "holidayEaster": "Ostern - Auferstehung des Herrn",
    "holidayEasterDesc": "Ostern ist das größte christliche Fest. Es feiert die Auferstehung Jesu Christi, des Siegers über den Tod. Es ist das Fundament unseres Glaubens und die Hoffnung auf das ewige Leben.",
    "holidayEasterMonday": "Ostermontag",
    "holidayEasterMondayDesc": "Der Ostermontag verlängert die österliche Freude. Das Evangelium erzählt von der Begegnung der Emmaus-Jünger mit dem auferstandenen Jesus, den sie beim Brotbrechen erkannten.",
    "holidayDivineMercy": "Sonntag der Barmherzigkeit Gottes",
    "holidayDivineMercyDesc": "Von Papst Johannes Paul II. eingeführt, feiert dieser Sonntag die unendliche Barmherzigkeit Gottes. Jesus vertraute diese Botschaft der heiligen Faustina an: 'Jesus, ich vertraue auf Dich.'",
    "holidayAscension": "Christi Himmelfahrt",
    "holidayAscensionDesc": "Christi Himmelfahrt feiert die Auffahrt Jesu in den Himmel, vierzig Tage nach Ostern. Der auferstandene Christus kehrt zu seinem Vater zurück und öffnet uns den Weg zum ewigen Leben.",
    "holidayPentecost": "Pfingsten",
    "holidayPentecostDesc": "Pfingsten feiert die Herabkunft des Heiligen Geistes auf die Apostel, fünfzig Tage nach Ostern. Es ist die Geburt der Kirche. Die Apostel empfangen die Kraft, das Evangelium zu verkünden.",
    "holidayPentecostMonday": "Pfingstmontag",
    "holidayPentecostMondayDesc": "Der Pfingstmontag verlängert das Pfingstfest und feiert die Gaben des Heiligen Geistes, die über die Kirche und jeden Getauften ausgegossen wurden.",
    "holidayTrinity": "Heilige Dreifaltigkeit",
    "holidayTrinityDesc": "Das Fest der Heiligen Dreifaltigkeit feiert das zentrale Geheimnis des christlichen Glaubens: ein Gott in drei gleichen und unterschiedlichen Personen - Vater, Sohn und Heiliger Geist.",
    "holidayCorpusChristi": "Fronleichnam",
    "holidayCorpusChristiDesc": "Fronleichnam feiert die wirkliche Gegenwart Jesu Christi in der Eucharistie. Feierliche Prozessionen tragen die konsekrierte Hostie, um den Glauben an dieses Geheimnis der Liebe zu bezeugen.",
    "holidaySacredHeart": "Heiligstes Herz Jesu",
    "holidaySacredHeartDesc": "Dieses Fest feiert die unendliche Liebe Christi zur Menschheit, symbolisiert durch sein Herz. Jesus offenbarte sein Herz der heiligen Margareta Maria: 'Sieh dieses Herz, das die Menschen so sehr geliebt hat.'",
    "holidayChristKing": "Christkönig",
    "holidayChristKingDesc": "Das letzte Fest des Kirchenjahres verkündet die universale Königsherrschaft Christi über die ganze Schöpfung. Sein Reich ist eines der Liebe, Gerechtigkeit und des Friedens.",
    "holidayAdvent": "Erster Adventssonntag",
    "holidayAdventDesc": "Beginn des Kirchenjahres und der Adventszeit, einer vierwöchigen Vorbereitungszeit auf Weihnachten. Die Kirche erwartet das Kommen des Erlösers mit Hoffnung."
}
