{
    "subtitle": "Christian Holidays Calendar & Saints of the Day",
    "saintOfDay": "Saint of the day",
    "searchYear": "Search a year",
    "yearPlaceholder": "Year (-46 to 9999)",
    "tabHolidays": "Holidays",
    "tabSaints": "Saints",
    "emptyHolidays": "Enter a year to see Christian holidays",
    "addToGoogle": "Add to Google Calendar",
    "legendMajor": "Major feast",
    "legendMobile": "Moveable feast",
    "legendFixed": "Fixed feast",
    "legendToday": "Today",
    "legendSaint": "Saint of the day",
    "footerTitle": "Christian Calendar",
    "legalNotice": "Legal notice",
    "gdpr": "GDPR",
    "footerCompliance": "Compliant with GDPR (EU 2016/679) and privacy laws",
    "mon": "Mon",
    "tue": "Tue",
    "wed": "Wed",
    "thu": "Thu",
    "fri": "Fri",
    "sat": "Sat",
    "sun": "Sun",
    "months": ["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"],
    "isLeapYear": "is a leap year",
    "isNotLeapYear": "is not a leap year",
    "days366": "366 days - February has 29 days",
    "days365": "365 days - February has 28 days",
    "impossible": "Cannot go",
    "beforeYear": "before 46 BC",
    "afterYear": "beyond year 9999",
    "enterValidYear": "Please enter a valid year (-46 to 9999)",
    "skippedDay": "Day removed during Gregorian reform",
    "churchCelebrates": "The Church celebrates",
    "eachDay": "Each day of the year is dedicated to the memory of one or more saints who witnessed their faith through their exemplary lives.",
    "donateBtn": "Donate",
    "donateTitle": "Donate to the church",
    "donateDescription": "Your support helps fund parish activities, building maintenance and charitable works.",
    "donateLinkText": "Donate",
    "donateLinkUrl": "https://paypal.com",
    "close": "Close",
    "flag": "🇬🇧",
    
    "calendarPreJulian": "Pre-Julian (Roman Calendar)",
    "calendarJulian": "Julian",
    "calendarTransition": "Julian → Gregorian Transition",
    "calendarGregorianFirst": "Gregorian (1st complete year)",
    "calendarGregorian": "Gregorian",
    
    "leapRuleRoman": "Ancient Roman calendar system",
    "leapRuleJulian": "Leap year if divisible by 4",
    "leapRuleTransition": "Transition year",
    "leapRuleGregorian": "Leap year if divisible by 4, except century years not divisible by 400",
    
    "descPreJulian": "In {year}, the ancient Roman calendar was in effect. The Julian calendar will be introduced in 45 BC.",
    "descJulianBC": "In {year}, the Julian calendar was in effect. Introduced by Julius Caesar in 45 BC.",
    "descJulianAD": "In {year}, the Julian calendar was in effect. It will be reformed in 1582.",
    "descTransition": "{year} is the year of the Gregorian reform! Pope Gregory XIII removed 10 days: we went from October 4 to October 15, 1582.",
    "descGregorianFirst": "{year} is the first complete year of the Gregorian calendar. The difference with the Julian calendar was 10 days at that time.",
    "descGregorian": "In {year}, the Gregorian calendar is in effect.",
    
    "easterGregorian": "Easter (Gregorian)",
    "easterJulian": "Easter (Julian)",
    "easterDaysDiff": "+{days} days",
    
    "noHolidaysBeforeYear0": "No Christian holidays before the birth of Christ (December 25, year 0)",
    
    "legalAndGdpr": "Legal Notice & GDPR",
    "legalTitle": "Legal Notice & GDPR",
    "legalSection1Title": "1. Website Publisher",
    "legalSection1Text1": "GigaFaith - Christian Calendar",
    "legalSection1Text2": "Informative and educational web application.",
    "legalSection2Title": "2. Hosting",
    "legalSection2Text": "Application hosted locally / self-hosted.",
    "legalSection3Title": "3. Personal Data Protection (GDPR)",
    "legalSection3Intro": "In accordance with the General Data Protection Regulation (GDPR - EU 2016/679):",
    "legalSection3Item1": "Data collected: No personal data is collected by this application.",
    "legalSection3Item2": "Cookies: Only a technical cookie is used to remember your theme preferences (light/dark). This cookie is strictly necessary for the site to function and does not require consent.",
    "legalSection3Item3": "LocalStorage: The chosen theme is stored locally on your browser.",
    "legalSection3Item4": "Data transfer: No data transfer to third parties.",
    "legalSection4Title": "4. Your Rights (Articles 15-22 GDPR)",
    "legalSection4Intro": "You have the following rights:",
    "legalSection4Item1": "Right of access to your data",
    "legalSection4Item2": "Right to rectification",
    "legalSection4Item3": "Right to erasure ('right to be forgotten')",
    "legalSection4Item4": "Right to restriction of processing",
    "legalSection4Item5": "Right to data portability",
    "legalSection4Item6": "Right to object",
    "legalSection4Note": "Note: These rights do not apply here as no personal data is collected.",
    "legalSection5Title": "5. Intellectual Property",
    "legalSection5Text": "Information about Christian holidays and saints comes from the public domain and Catholic tradition.",
    "legalSection6Title": "6. Applicable Law",
    "legalSection6Intro": "This site is subject to European law, including:",
    "legalSection6Item1": "General Data Protection Regulation (EU) 2016/679",
    "legalSection6Item2": "ePrivacy Directive 2002/58/EC",
    "legalSection6Item3": "National data protection laws",
    "legalSection7Title": "7. Data Protection Authority Contact",
    "legalSection7Intro": "For any questions regarding data protection, you can contact your local data protection authority:",
    "legalSection7Authority": "Information Commissioner's Office (UK) or your national DPA",
    "legalSection7Address": "Visit your country's data protection authority website",
    "legalSection7Website": "ico.org.uk",
    "legalUnderstood": "I understand",

    "holidayMaryMotherOfGod": "Mary, Mother of God",
    "holidayMaryMotherOfGodDesc": "On the first day of the year, this feast celebrates Mary's divine motherhood. She is the mother of Jesus Christ, the Son of God made man. This solemnity is also World Peace Day.",
    "holidayEpiphany": "Epiphany",
    "holidayEpiphanyDesc": "Epiphany celebrates the manifestation of Jesus to the Magi from the East. These wise men, guided by a star, brought gold, frankincense, and myrrh to the infant Christ. This feast symbolizes God's revelation to all peoples.",
    "holidayPresentation": "Presentation of the Lord",
    "holidayPresentationDesc": "Forty days after Christmas, this feast commemorates the presentation of Jesus at the Temple in Jerusalem by Mary and Joseph, according to Jewish law. It is also known as Candlemas.",
    "holidaySaintJoseph": "Saint Joseph",
    "holidaySaintJosephDesc": "Feast of Saint Joseph, spouse of the Virgin Mary and foster father of Jesus. He is the patron of workers, fathers, and the Universal Church.",
    "holidayAnnunciation": "Annunciation",
    "holidayAnnunciationDesc": "The Annunciation celebrates the announcement made to Mary by the Archangel Gabriel that she would become the mother of the Son of God. Mary said 'Yes' to God, making the Incarnation possible.",
    "holidayJohnBaptistBirth": "Nativity of Saint John the Baptist",
    "holidayJohnBaptistBirthDesc": "This feast celebrates the birth of John the Baptist, the forerunner of Christ. He prepared the way of the Lord and baptized Jesus in the Jordan River.",
    "holidayPeterPaul": "Saints Peter and Paul",
    "holidayPeterPaulDesc": "A solemnity celebrating the two pillars of the Church: Peter, the leader of the apostles to whom Jesus entrusted the keys of the Kingdom, and Paul, the apostle to the nations who evangelized the pagan world.",
    "holidayTransfiguration": "Transfiguration",
    "holidayTransfigurationDesc": "The Transfiguration commemorates the moment when Jesus, on Mount Tabor, revealed his divine glory to Peter, James, and John. His face shone like the sun.",
    "holidayAssumption": "Assumption",
    "holidayAssumptionDesc": "The Assumption celebrates the Virgin Mary's ascent to heaven with her soul and body at the end of her earthly life. She was the first of the redeemed to enter heavenly glory.",
    "holidayMaryBirth": "Nativity of the Blessed Virgin Mary",
    "holidayMaryBirthDesc": "This feast celebrates the birth of Mary, who would become the mother of Jesus. She was born without original sin, prepared by God to be the mother of the Savior.",
    "holidayHolyCross": "Exaltation of the Holy Cross",
    "holidayHolyCrossDesc": "This feast exalts the Holy Cross, the instrument of our salvation. It commemorates the discovery of the True Cross by Saint Helena and Christ's victory over death.",
    "holidayAllSaints": "All Saints",
    "holidayAllSaintsDesc": "All Saints is the feast of all saints, known and unknown, who are in paradise. It reminds us that we are all called to holiness and eternal life with God.",
    "holidayAllSouls": "All Souls Day",
    "holidayAllSoulsDesc": "The day after All Saints, the Church prays for all the faithful departed who are in purgatory, so that they may be purified and enter the joy of Heaven.",
    "holidayImmaculateConception": "Immaculate Conception",
    "holidayImmaculateConceptionDesc": "This solemnity celebrates Mary's conception without original sin. From the first moment of her existence, Mary was preserved from sin to become the mother of the Savior.",
    "holidayChristmas": "Christmas - Nativity of the Lord",
    "holidayChristmasDesc": "Christmas celebrates the birth of Jesus Christ in Bethlehem. The Son of God became man to save us. It is the feast of God's love coming to dwell among us.",
    "holidaySaintStephen": "Saint Stephen",
    "holidaySaintStephenDesc": "Feast of the first Christian martyr. Stephen, a deacon filled with the Holy Spirit, was stoned for his faith in Jesus Christ. He forgave his executioners as Christ did on the cross.",
    "holidaySaintJohn": "Saint John the Evangelist",
    "holidaySaintJohnDesc": "Feast of the Apostle John, the disciple whom Jesus loved. He is the author of the fourth Gospel, three epistles, and Revelation. He is the only apostle to die of old age.",
    "holidayHolyInnocents": "Holy Innocents",
    "holidayHolyInnocentsDesc": "This feast commemorates the children of Bethlehem massacred by order of King Herod, who was trying to kill the infant Jesus. They are considered the first martyrs.",

    "holidayAshWednesday": "Ash Wednesday",
    "holidayAshWednesdayDesc": "The beginning of Lent, a 40-day period of preparation for Easter. The ashes, placed on the forehead, remind us of our mortality and invite us to conversion.",
    "holidayPalmSunday": "Palm Sunday",
    "holidayPalmSundayDesc": "This Sunday opens Holy Week and commemorates Jesus' triumphal entry into Jerusalem. The people acclaimed him with palm branches, crying 'Hosanna!'",
    "holidayHolyThursday": "Holy Thursday",
    "holidayHolyThursdayDesc": "Holy Thursday commemorates Jesus' last supper with his apostles, during which he instituted the Eucharist and the priesthood. He also washed his disciples' feet.",
    "holidayGoodFriday": "Good Friday",
    "holidayGoodFridayDesc": "Good Friday is the day of Jesus' crucifixion and death on the cross. It is a day of fasting and prayer when the Church venerates the Cross of the Savior.",
    "holidayHolySaturday": "Holy Saturday",
    "holidayHolySaturdayDesc": "A day of silence and waiting between Christ's death and resurrection. The Church keeps vigil at the tomb. The Easter Vigil, at night, celebrates the Resurrection.",
    "holidayEaster": "Easter - Resurrection of the Lord",
    "holidayEasterDesc": "Easter is the greatest Christian feast. It celebrates the resurrection of Jesus Christ, victorious over death. It is the foundation of our faith and the hope of eternal life.",
    "holidayEasterMonday": "Easter Monday",
    "holidayEasterMondayDesc": "Easter Monday extends the Easter joy. The Gospel tells of the disciples of Emmaus meeting the risen Jesus, whom they recognized in the breaking of bread.",
    "holidayDivineMercy": "Divine Mercy Sunday",
    "holidayDivineMercyDesc": "Instituted by Saint John Paul II, this Sunday celebrates God's infinite mercy. Jesus entrusted this message to Saint Faustina: 'Jesus, I trust in You.'",
    "holidayAscension": "Ascension",
    "holidayAscensionDesc": "The Ascension celebrates Jesus' ascent to Heaven, forty days after Easter. The risen Christ joins his Father and opens the way to eternal life for us.",
    "holidayPentecost": "Pentecost",
    "holidayPentecostDesc": "Pentecost celebrates the descent of the Holy Spirit upon the apostles, fifty days after Easter. It is the birth of the Church. The apostles received the power to proclaim the Gospel.",
    "holidayPentecostMonday": "Pentecost Monday",
    "holidayPentecostMondayDesc": "Pentecost Monday extends the feast of Pentecost and celebrates the gifts of the Holy Spirit poured out on the Church and on every baptized person.",
    "holidayTrinity": "Holy Trinity",
    "holidayTrinityDesc": "The feast of the Holy Trinity celebrates the central mystery of the Christian faith: one God in three equal and distinct persons - the Father, the Son, and the Holy Spirit.",
    "holidayCorpusChristi": "Corpus Christi",
    "holidayCorpusChristiDesc": "Corpus Christi celebrates the real presence of Jesus Christ in the Eucharist. Solemn processions carry the consecrated host to manifest faith in this mystery of love.",
    "holidaySacredHeart": "Sacred Heart of Jesus",
    "holidaySacredHeartDesc": "This feast celebrates Christ's infinite love for humanity, symbolized by his Heart. Jesus revealed his Heart to Saint Margaret Mary: 'Behold this Heart which has loved men so much.'",
    "holidayChristKing": "Christ the King",
    "holidayChristKingDesc": "The last feast of the liturgical year, it proclaims the universal kingship of Christ over all creation. His reign is one of love, justice, and peace.",
    "holidayAdvent": "First Sunday of Advent",
    "holidayAdventDesc": "The beginning of the liturgical year and Advent season, a four-week period of preparation for Christmas. The Church awaits the coming of the Savior with hope."
}
