{
    "subtitle": "Calendario de Fiestas Cristianas y Santos del Día",
    "saintOfDay": "Santo del día",
    "searchYear": "Buscar un año",
    "yearPlaceholder": "Año (-46 a 9999)",
    "tabHolidays": "Fiestas",
    "tabSaints": "Santos",
    "emptyHolidays": "Ingrese un año para ver las fiestas cristianas",
    "addToGoogle": "Añadir a Google Calendar",
    "legendMajor": "Fiesta mayor",
    "legendMobile": "Fiesta móvil",
    "legendFixed": "Fiesta fija",
    "legendToday": "Hoy",
    "legendSaint": "Santo del día",
    "footerTitle": "Calendario Cristiano",
    "legalNotice": "Aviso legal",
    "gdpr": "RGPD",
    "footerCompliance": "Conforme al RGPD (UE 2016/679) y las leyes de privacidad",
    "mon": "Lun",
    "tue": "Mar",
    "wed": "Mié",
    "thu": "Jue",
    "fri": "Vie",
    "sat": "Sáb",
    "sun": "Dom",
    "months": ["Enero", "Febrero", "Marzo", "Abril", "Mayo", "Junio", "Julio", "Agosto", "Septiembre", "Octubre", "Noviembre", "Diciembre"],
    "isLeapYear": "es bisiesto",
    "isNotLeapYear": "no es bisiesto",
    "days366": "366 días - Febrero tiene 29 días",
    "days365": "365 días - Febrero tiene 28 días",
    "impossible": "No se puede ir",
    "beforeYear": "antes del año 46 a.C.",
    "afterYear": "más allá del año 9999",
    "enterValidYear": "Por favor ingrese un año válido (-46 a 9999)",
    "skippedDay": "Día eliminado durante la reforma gregoriana",
    "churchCelebrates": "La Iglesia celebra",
    "eachDay": "Cada día del año está dedicado a la memoria de uno o más santos que testimoniaron su fe con su vida ejemplar.",
    "donateBtn": "Donar",
    "donateTitle": "Donar a la iglesia",
    "donateDescription": "Su apoyo ayuda a financiar las actividades parroquiales, el mantenimiento del edificio y las obras de caridad.",
    "donateLinkText": "Donar",
    "donateLinkUrl": "https://paypal.com",
    "close": "Cerrar",
    "flag": "🇪🇸",
    
    "calendarPreJulian": "Pre-Juliano (Calendario romano)",
    "calendarJulian": "Juliano",
    "calendarTransition": "Transición Juliano → Gregoriano",
    "calendarGregorianFirst": "Gregoriano (1er año completo)",
    "calendarGregorian": "Gregoriano",
    
    "leapRuleRoman": "Sistema de calendario romano antiguo",
    "leapRuleJulian": "Bisiesto si es divisible por 4",
    "leapRuleTransition": "Año de transición",
    "leapRuleGregorian": "Bisiesto si es divisible por 4, excepto años seculares no divisibles por 400",
    
    "descPreJulian": "En {year}, el calendario romano antiguo estaba en vigor. El calendario Juliano se introducirá en el 45 a.C.",
    "descJulianBC": "En {year}, el calendario Juliano estaba en vigor. Introducido por Julio César en el 45 a.C.",
    "descJulianAD": "En {year}, el calendario Juliano estaba en vigor. Será reformado en 1582.",
    "descTransition": "¡{year} es el año de la reforma gregoriana! El Papa Gregorio XIII suprimió 10 días: pasamos del 4 de octubre al 15 de octubre de 1582.",
    "descGregorianFirst": "{year} es el primer año completo del calendario Gregoriano. La diferencia con el calendario Juliano era de 10 días en esa época.",
    "descGregorian": "En {year}, el calendario Gregoriano está en vigor.",
    
    "easterGregorian": "Pascua (Gregoriano)",
    "easterJulian": "Pascua (Juliano)",
    "easterDaysDiff": "+{days} días",
    
    "noHolidaysBeforeYear0": "No hay fiestas cristianas antes del nacimiento de Cristo (25 de diciembre del año 0)",
    
    "legalAndGdpr": "Aviso legal y RGPD",
    "legalTitle": "Aviso Legal y RGPD",
    "legalSection1Title": "1. Editor del sitio",
    "legalSection1Text1": "GigaFaith - Calendario Cristiano",
    "legalSection1Text2": "Aplicación web con fines informativos y educativos.",
    "legalSection2Title": "2. Alojamiento",
    "legalSection2Text": "Aplicación alojada localmente / autoalojada.",
    "legalSection3Title": "3. Protección de datos personales (RGPD)",
    "legalSection3Intro": "De conformidad con el Reglamento General de Protección de Datos (RGPD - UE 2016/679):",
    "legalSection3Item1": "Datos recopilados: Esta aplicación no recopila datos personales.",
    "legalSection3Item2": "Cookies: Solo se utiliza una cookie técnica para recordar sus preferencias de tema (claro/oscuro). Esta cookie es estrictamente necesaria para el funcionamiento del sitio y no requiere consentimiento.",
    "legalSection3Item3": "LocalStorage: El tema elegido se almacena localmente en su navegador.",
    "legalSection3Item4": "Transferencia de datos: No hay transferencia de datos a terceros.",
    "legalSection4Title": "4. Sus derechos (Artículos 15-22 RGPD)",
    "legalSection4Intro": "Usted tiene los siguientes derechos:",
    "legalSection4Item1": "Derecho de acceso a sus datos",
    "legalSection4Item2": "Derecho de rectificación",
    "legalSection4Item3": "Derecho de supresión ('derecho al olvido')",
    "legalSection4Item4": "Derecho a la limitación del tratamiento",
    "legalSection4Item5": "Derecho a la portabilidad de los datos",
    "legalSection4Item6": "Derecho de oposición",
    "legalSection4Note": "Nota: Estos derechos no se aplican aquí ya que no se recopilan datos personales.",
    "legalSection5Title": "5. Propiedad intelectual",
    "legalSection5Text": "La información sobre las fiestas cristianas y los santos proviene del dominio público y la tradición católica.",
    "legalSection6Title": "6. Ley aplicable",
    "legalSection6Intro": "Este sitio está sujeto al derecho europeo, incluyendo:",
    "legalSection6Item1": "Reglamento General de Protección de Datos (UE) 2016/679",
    "legalSection6Item2": "Ley Orgánica 3/2018 de Protección de Datos (España)",
    "legalSection6Item3": "Ley 34/2002 de Servicios de la Sociedad de la Información",
    "legalSection7Title": "7. Contacto autoridad de protección",
    "legalSection7Intro": "Para cualquier pregunta relacionada con la protección de datos, puede contactar con:",
    "legalSection7Authority": "Agencia Española de Protección de Datos",
    "legalSection7Address": "C/ Jorge Juan, 6, 28001 Madrid",
    "legalSection7Website": "www.aepd.es",
    "legalUnderstood": "Entendido",

    "holidayMaryMotherOfGod": "Santa María, Madre de Dios",
    "holidayMaryMotherOfGodDesc": "El primer día del año, esta fiesta celebra la maternidad divina de María. Ella es la madre de Jesucristo, el Hijo de Dios hecho hombre. Esta solemnidad es también la Jornada Mundial de la Paz.",
    "holidayEpiphany": "Epifanía",
    "holidayEpiphanyDesc": "La Epifanía celebra la manifestación de Jesús a los Magos de Oriente. Estos sabios, guiados por una estrella, trajeron al Niño Jesús oro, incienso y mirra. Esta fiesta simboliza la revelación de Dios a todos los pueblos.",
    "holidayPresentation": "Presentación del Señor",
    "holidayPresentationDesc": "Cuarenta días después de Navidad, esta fiesta conmemora la presentación de Jesús en el Templo de Jerusalén por María y José, según la ley judía. También se conoce como la Candelaria.",
    "holidaySaintJoseph": "San José",
    "holidaySaintJosephDesc": "Fiesta de San José, esposo de la Virgen María y padre nutricio de Jesús. Es el patrón de los trabajadores, los padres de familia y de la Iglesia Universal.",
    "holidayAnnunciation": "Anunciación",
    "holidayAnnunciationDesc": "La Anunciación celebra el anuncio hecho a María por el Arcángel Gabriel de que sería la madre del Hijo de Dios. María respondió 'Sí' a Dios, haciendo posible la Encarnación.",
    "holidayJohnBaptistBirth": "Natividad de San Juan Bautista",
    "holidayJohnBaptistBirthDesc": "Esta fiesta celebra el nacimiento de Juan Bautista, el precursor de Cristo. Él preparó el camino del Señor y bautizó a Jesús en el río Jordán.",
    "holidayPeterPaul": "Santos Pedro y Pablo",
    "holidayPeterPaulDesc": "Solemnidad que celebra los dos pilares de la Iglesia: Pedro, el líder de los apóstoles a quien Jesús confió las llaves del Reino, y Pablo, el apóstol de las naciones que evangelizó el mundo pagano.",
    "holidayTransfiguration": "Transfiguración",
    "holidayTransfigurationDesc": "La Transfiguración conmemora el momento en que Jesús, en el monte Tabor, reveló su gloria divina a Pedro, Santiago y Juan. Su rostro brillaba como el sol.",
    "holidayAssumption": "Asunción",
    "holidayAssumptionDesc": "La Asunción celebra la subida de la Virgen María al cielo con su alma y cuerpo al final de su vida terrena. Ella fue la primera de los redimidos en entrar en la gloria celestial.",
    "holidayMaryBirth": "Natividad de la Virgen María",
    "holidayMaryBirthDesc": "Esta fiesta celebra el nacimiento de María, quien se convertiría en la madre de Jesús. Nació sin pecado original, preparada por Dios para ser la madre del Salvador.",
    "holidayHolyCross": "Exaltación de la Santa Cruz",
    "holidayHolyCrossDesc": "Esta fiesta exalta la Santa Cruz, instrumento de nuestra salvación. Conmemora el descubrimiento de la Verdadera Cruz por Santa Elena y la victoria de Cristo sobre la muerte.",
    "holidayAllSaints": "Todos los Santos",
    "holidayAllSaintsDesc": "Todos los Santos es la fiesta de todos los santos, conocidos y desconocidos, que están en el paraíso. Nos recuerda que todos estamos llamados a la santidad y a la vida eterna con Dios.",
    "holidayAllSouls": "Conmemoración de los Fieles Difuntos",
    "holidayAllSoulsDesc": "El día después de Todos los Santos, la Iglesia reza por todos los fieles difuntos que están en el purgatorio, para que sean purificados y entren en la alegría del Cielo.",
    "holidayImmaculateConception": "Inmaculada Concepción",
    "holidayImmaculateConceptionDesc": "Esta solemnidad celebra la concepción de María sin pecado original. Desde el primer instante de su existencia, María fue preservada del pecado para convertirse en la madre del Salvador.",
    "holidayChristmas": "Navidad - Natividad del Señor",
    "holidayChristmasDesc": "La Navidad celebra el nacimiento de Jesucristo en Belén. El Hijo de Dios se hizo hombre para salvarnos. Es la fiesta del amor de Dios que viene a habitar entre nosotros.",
    "holidaySaintStephen": "San Esteban",
    "holidaySaintStephenDesc": "Fiesta del primer mártir cristiano. Esteban, diácono lleno del Espíritu Santo, fue apedreado por su fe en Jesucristo. Perdonó a sus verdugos como Cristo en la cruz.",
    "holidaySaintJohn": "San Juan Evangelista",
    "holidaySaintJohnDesc": "Fiesta del apóstol Juan, el discípulo que Jesús amaba. Es el autor del cuarto Evangelio, tres epístolas y el Apocalipsis. Es el único apóstol que murió de vejez.",
    "holidayHolyInnocents": "Santos Inocentes",
    "holidayHolyInnocentsDesc": "Esta fiesta conmemora a los niños de Belén masacrados por orden del rey Herodes, que intentaba matar al niño Jesús. Son considerados los primeros mártires.",

    "holidayAshWednesday": "Miércoles de Ceniza",
    "holidayAshWednesdayDesc": "Inicio de la Cuaresma, período de 40 días de preparación para la Pascua. Las cenizas, puestas en la frente, nos recuerdan nuestra condición mortal y nos invitan a la conversión.",
    "holidayPalmSunday": "Domingo de Ramos",
    "holidayPalmSundayDesc": "Este domingo abre la Semana Santa y conmemora la entrada triunfal de Jesús en Jerusalén. El pueblo lo aclamaba con ramas de palma, gritando '¡Hosanna!'",
    "holidayHolyThursday": "Jueves Santo",
    "holidayHolyThursdayDesc": "El Jueves Santo conmemora la última cena de Jesús con sus apóstoles, durante la cual instituyó la Eucaristía y el sacerdocio. También lavó los pies de sus discípulos.",
    "holidayGoodFriday": "Viernes Santo",
    "holidayGoodFridayDesc": "El Viernes Santo es el día de la crucifixión y muerte de Jesús en la cruz. Es un día de ayuno y oración donde la Iglesia venera la Cruz del Salvador.",
    "holidayHolySaturday": "Sábado Santo",
    "holidayHolySaturdayDesc": "Día de silencio y espera entre la muerte y la resurrección de Cristo. La Iglesia vela junto al sepulcro. La Vigilia Pascual, por la noche, celebra la Resurrección.",
    "holidayEaster": "Pascua - Resurrección del Señor",
    "holidayEasterDesc": "La Pascua es la fiesta cristiana más importante. Celebra la resurrección de Jesucristo, vencedor de la muerte. Es el fundamento de nuestra fe y la esperanza de la vida eterna.",
    "holidayEasterMonday": "Lunes de Pascua",
    "holidayEasterMondayDesc": "El Lunes de Pascua prolonga la alegría pascual. El Evangelio narra el encuentro de los discípulos de Emaús con Jesús resucitado, a quien reconocieron en la fracción del pan.",
    "holidayDivineMercy": "Domingo de la Divina Misericordia",
    "holidayDivineMercyDesc": "Instituido por San Juan Pablo II, este domingo celebra la misericordia infinita de Dios. Jesús confió este mensaje a Santa Faustina: 'Jesús, en Ti confío.'",
    "holidayAscension": "Ascensión",
    "holidayAscensionDesc": "La Ascensión celebra la subida de Jesús al Cielo, cuarenta días después de Pascua. Cristo resucitado se reúne con su Padre y nos abre el camino a la vida eterna.",
    "holidayPentecost": "Pentecostés",
    "holidayPentecostDesc": "Pentecostés celebra el descenso del Espíritu Santo sobre los apóstoles, cincuenta días después de Pascua. Es el nacimiento de la Iglesia. Los apóstoles reciben la fuerza para anunciar el Evangelio.",
    "holidayPentecostMonday": "Lunes de Pentecostés",
    "holidayPentecostMondayDesc": "El Lunes de Pentecostés prolonga la fiesta de Pentecostés y celebra los dones del Espíritu Santo derramados sobre la Iglesia y sobre cada bautizado.",
    "holidayTrinity": "Santísima Trinidad",
    "holidayTrinityDesc": "La fiesta de la Santísima Trinidad celebra el misterio central de la fe cristiana: un solo Dios en tres personas iguales y distintas - el Padre, el Hijo y el Espíritu Santo.",
    "holidayCorpusChristi": "Corpus Christi",
    "holidayCorpusChristiDesc": "Corpus Christi celebra la presencia real de Jesucristo en la Eucaristía. Procesiones solemnes llevan la hostia consagrada para manifestar la fe en este misterio de amor.",
    "holidaySacredHeart": "Sagrado Corazón de Jesús",
    "holidaySacredHeartDesc": "Esta fiesta celebra el amor infinito de Cristo por la humanidad, simbolizado por su Corazón. Jesús reveló su Corazón a Santa Margarita María: 'He aquí este Corazón que tanto ha amado a los hombres.'",
    "holidayChristKing": "Cristo Rey del Universo",
    "holidayChristKingDesc": "Última fiesta del año litúrgico, proclama la realeza universal de Cristo sobre toda la creación. Su reino es de amor, justicia y paz.",
    "holidayAdvent": "Primer Domingo de Adviento",
    "holidayAdventDesc": "Inicio del año litúrgico y del tiempo de Adviento, período de cuatro semanas de preparación para la Navidad. La Iglesia espera la venida del Salvador con esperanza."
}
