{
    "subtitle": "Calendrier des Fêtes Chrétiennes & Saints du Jour",
    "saintOfDay": "Saint du jour",
    "searchYear": "Rechercher une année",
    "yearPlaceholder": "Année (-46 à 9999)",
    "tabHolidays": "Fêtes",
    "tabSaints": "Saints",
    "emptyHolidays": "Entrez une année pour voir les fêtes chrétiennes",
    "addToGoogle": "Ajouter à Google Calendar",
    "legendMajor": "Fête majeure",
    "legendMobile": "Fête mobile",
    "legendFixed": "Fête fixe",
    "legendToday": "Aujourd'hui",
    "legendSaint": "Saint du jour",
    "footerTitle": "Calendrier Chrétien",
    "legalNotice": "Mentions légales",
    "gdpr": "RGPD",
    "footerCompliance": "Conforme au RGPD (UE 2016/679) et à la loi Informatique et Libertés",
    "mon": "Lun",
    "tue": "Mar",
    "wed": "Mer",
    "thu": "Jeu",
    "fri": "Ven",
    "sat": "Sam",
    "sun": "Dim",
    "months": ["Janvier", "Février", "Mars", "Avril", "Mai", "Juin", "Juillet", "Août", "Septembre", "Octobre", "Novembre", "Décembre"],
    "isLeapYear": "est bissextile",
    "isNotLeapYear": "n'est pas bissextile",
    "days366": "366 jours - Février a 29 jours",
    "days365": "365 jours - Février a 28 jours",
    "impossible": "Impossible d'aller",
    "beforeYear": "avant l'an 46 av. J.-C.",
    "afterYear": "au-delà de l'an 9999",
    "enterValidYear": "Veuillez entrer une année valide (-46 à 9999)",
    "skippedDay": "Jour supprimé lors de la réforme grégorienne",
    "churchCelebrates": "L'Église fête",
    "eachDay": "Chaque jour de l'année est dédié à la mémoire d'un ou plusieurs saints qui ont témoigné de leur foi par leur vie exemplaire.",
    "donateBtn": "Faire un don",
    "donateTitle": "Faire un don à l'église",
    "donateDescription": "Votre soutien permet de financer les activités paroissiales, la maintenance du bâtiment et les œuvres caritatives.",
    "donateLinkText": "Faire un don",
    "donateLinkUrl": "https://paypal.com",
    "close": "Fermer",
    "flag": "🇫🇷",
    
    "calendarPreJulian": "Pré-Julien (Calendrier romain)",
    "calendarJulian": "Julien",
    "calendarTransition": "Transition Julien → Grégorien",
    "calendarGregorianFirst": "Grégorien (1ère année complète)",
    "calendarGregorian": "Grégorien",
    
    "leapRuleRoman": "Système calendaire romain antique",
    "leapRuleJulian": "Bissextile si divisible par 4",
    "leapRuleTransition": "Année de transition",
    "leapRuleGregorian": "Bissextile si divisible par 4, sauf les années séculaires non divisibles par 400",
    
    "descPreJulian": "En {year}, le calendrier romain antique était en vigueur. Le calendrier Julien sera introduit en 45 av. J.-C.",
    "descJulianBC": "En {year}, le calendrier Julien était en vigueur. Introduit par Jules César en 45 av. J.-C.",
    "descJulianAD": "En {year}, le calendrier Julien était en vigueur. Il sera réformé en 1582.",
    "descTransition": "{year} est l'année de la réforme grégorienne ! Le pape Grégoire XIII a supprimé 10 jours : on est passé du 4 octobre au 15 octobre 1582.",
    "descGregorianFirst": "{year} est la première année complète du calendrier Grégorien. La différence avec le calendrier Julien était de 10 jours à cette époque.",
    "descGregorian": "En {year}, le calendrier Grégorien est en vigueur.",
    
    "easterGregorian": "Pâques (Grégorien)",
    "easterJulian": "Pâques (Julien)",
    "easterDaysDiff": "+{days} jours",
    
    "noHolidaysBeforeYear0": "Pas de fêtes chrétiennes avant la naissance du Christ (25 décembre an 0)",
    
    "legalAndGdpr": "Mentions légales & RGPD",
    "legalTitle": "Mentions Légales & RGPD",
    "legalSection1Title": "1. Éditeur du site",
    "legalSection1Text1": "GigaFaith - Calendrier Chrétien",
    "legalSection1Text2": "Application web à but informatif et éducatif.",
    "legalSection2Title": "2. Hébergement",
    "legalSection2Text": "Application hébergée localement / auto-hébergée.",
    "legalSection3Title": "3. Protection des données personnelles (RGPD)",
    "legalSection3Intro": "Conformément au Règlement Général sur la Protection des Données (RGPD - UE 2016/679) :",
    "legalSection3Item1": "Données collectées : Aucune donnée personnelle n'est collectée par cette application.",
    "legalSection3Item2": "Cookies : Seul un cookie technique est utilisé pour mémoriser vos préférences de thème (clair/sombre). Ce cookie est strictement nécessaire au fonctionnement du site et ne nécessite pas de consentement.",
    "legalSection3Item3": "LocalStorage : Le thème choisi est stocké localement sur votre navigateur.",
    "legalSection3Item4": "Transfert de données : Aucun transfert de données vers des tiers.",
    "legalSection4Title": "4. Vos droits (Articles 15-22 RGPD)",
    "legalSection4Intro": "Vous disposez des droits suivants :",
    "legalSection4Item1": "Droit d'accès à vos données",
    "legalSection4Item2": "Droit de rectification",
    "legalSection4Item3": "Droit à l'effacement (« droit à l'oubli »)",
    "legalSection4Item4": "Droit à la limitation du traitement",
    "legalSection4Item5": "Droit à la portabilité des données",
    "legalSection4Item6": "Droit d'opposition",
    "legalSection4Note": "Note : Ces droits ne s'appliquent pas ici car aucune donnée personnelle n'est collectée.",
    "legalSection5Title": "5. Propriété intellectuelle",
    "legalSection5Text": "Les informations sur les fêtes chrétiennes et les saints sont issues du domaine public et de la tradition catholique.",
    "legalSection6Title": "6. Loi applicable",
    "legalSection6Intro": "Le présent site est soumis au droit français et européen, notamment :",
    "legalSection6Item1": "Loi n° 78-17 du 6 janvier 1978 « Informatique et Libertés »",
    "legalSection6Item2": "Règlement (UE) 2016/679 (RGPD)",
    "legalSection6Item3": "Loi n° 2004-575 du 21 juin 2004 (LCEN)",
    "legalSection7Title": "7. Contact autorité de protection",
    "legalSection7Intro": "Pour toute question relative à la protection des données, vous pouvez contacter la CNIL :",
    "legalSection7Authority": "Commission Nationale de l'Informatique et des Libertés",
    "legalSection7Address": "3 Place de Fontenoy, TSA 80715, 75334 PARIS CEDEX 07",
    "legalSection7Website": "www.cnil.fr",
    "legalUnderstood": "J'ai compris",

    "holidayMaryMotherOfGod": "Sainte Marie, Mère de Dieu",
    "holidayMaryMotherOfGodDesc": "Premier jour de l'année, cette fête célèbre la maternité divine de Marie. Elle est la mère de Jésus-Christ, le Fils de Dieu fait homme. Cette solennité est aussi la Journée mondiale de la paix.",
    "holidayEpiphany": "Épiphanie",
    "holidayEpiphanyDesc": "L'Épiphanie célèbre la manifestation de Jésus aux mages venus d'Orient. Ces sages, guidés par une étoile, apportèrent au Christ enfant l'or, l'encens et la myrrhe. Cette fête symbolise la révélation de Dieu à tous les peuples.",
    "holidayPresentation": "Présentation de Jésus au Temple",
    "holidayPresentationDesc": "Quarante jours après Noël, cette fête commémore la présentation de Jésus au Temple de Jérusalem par Marie et Joseph, selon la loi juive. C'est aussi la fête de la Chandeleur.",
    "holidaySaintJoseph": "Saint Joseph",
    "holidaySaintJosephDesc": "Fête de saint Joseph, époux de la Vierge Marie et père nourricier de Jésus. Il est le patron des travailleurs, des pères de famille et de l'Église universelle.",
    "holidayAnnunciation": "Annonciation",
    "holidayAnnunciationDesc": "L'Annonciation célèbre l'annonce faite à Marie par l'archange Gabriel qu'elle deviendrait la mère du Fils de Dieu. Marie a répondu « Oui » à Dieu, permettant l'Incarnation.",
    "holidayJohnBaptistBirth": "Nativité de Saint Jean-Baptiste",
    "holidayJohnBaptistBirthDesc": "Cette fête célèbre la naissance de Jean-Baptiste, le précurseur du Christ. Il est celui qui a préparé le chemin du Seigneur et baptisé Jésus dans le Jourdain.",
    "holidayPeterPaul": "Saints Pierre et Paul",
    "holidayPeterPaulDesc": "Solennité célébrant les deux piliers de l'Église : Pierre, le chef des apôtres à qui Jésus a confié les clés du Royaume, et Paul, l'apôtre des nations qui a évangélisé le monde païen.",
    "holidayTransfiguration": "Transfiguration",
    "holidayTransfigurationDesc": "La Transfiguration commémore le moment où Jésus, sur le mont Thabor, s'est montré dans sa gloire divine à Pierre, Jacques et Jean. Son visage resplendit comme le soleil.",
    "holidayAssumption": "Assomption",
    "holidayAssumptionDesc": "L'Assomption célèbre la montée de la Vierge Marie au ciel avec son âme et son corps à la fin de sa vie terrestre. Elle est la première des rachetés à entrer dans la gloire céleste.",
    "holidayMaryBirth": "Nativité de la Vierge Marie",
    "holidayMaryBirthDesc": "Cette fête célèbre la naissance de Marie, celle qui deviendra la mère de Jésus. Elle est née sans péché originel, préparée par Dieu pour être la mère du Sauveur.",
    "holidayHolyCross": "La Croix Glorieuse",
    "holidayHolyCrossDesc": "Cette fête exalte la Sainte Croix, instrument de notre salut. Elle commémore la découverte de la vraie Croix par sainte Hélène et la victoire du Christ sur la mort.",
    "holidayAllSaints": "Toussaint",
    "holidayAllSaintsDesc": "La Toussaint est la fête de tous les saints, connus et inconnus, qui sont au paradis. Elle nous rappelle que nous sommes tous appelés à la sainteté et à la vie éternelle avec Dieu.",
    "holidayAllSouls": "Commémoration des fidèles défunts",
    "holidayAllSoulsDesc": "Le lendemain de la Toussaint, l'Église prie pour tous les fidèles défunts qui sont au purgatoire, afin qu'ils soient purifiés et puissent entrer dans la joie du Ciel.",
    "holidayImmaculateConception": "Immaculée Conception",
    "holidayImmaculateConceptionDesc": "Cette solennité célèbre la conception de Marie sans péché originel. Dès le premier instant de son existence, Marie a été préservée du péché en vue de devenir la mère du Sauveur.",
    "holidayChristmas": "Noël - Nativité du Seigneur",
    "holidayChristmasDesc": "Noël célèbre la naissance de Jésus-Christ à Bethléem. Le Fils de Dieu s'est fait homme pour nous sauver. C'est la fête de l'amour de Dieu qui vient habiter parmi nous.",
    "holidaySaintStephen": "Saint Étienne",
    "holidaySaintStephenDesc": "Fête du premier martyr chrétien. Étienne, diacre rempli de l'Esprit Saint, a été lapidé pour sa foi en Jésus-Christ. Il a pardonné à ses bourreaux comme le Christ sur la croix.",
    "holidaySaintJohn": "Saint Jean l'Évangéliste",
    "holidaySaintJohnDesc": "Fête de l'apôtre Jean, le disciple que Jésus aimait. Il est l'auteur du quatrième Évangile, de trois épîtres et de l'Apocalypse. Il est le seul apôtre mort de vieillesse.",
    "holidayHolyInnocents": "Saints Innocents",
    "holidayHolyInnocentsDesc": "Cette fête commémore les enfants de Bethléem massacrés sur ordre du roi Hérode, qui cherchait à tuer l'enfant Jésus. Ils sont considérés comme les premiers martyrs.",

    "holidayAshWednesday": "Mercredi des Cendres",
    "holidayAshWednesdayDesc": "Début du Carême, période de 40 jours de préparation à Pâques. Les cendres, imposées sur le front, rappellent notre condition mortelle et nous invitent à la conversion.",
    "holidayPalmSunday": "Dimanche des Rameaux",
    "holidayPalmSundayDesc": "Ce dimanche ouvre la Semaine Sainte et commémore l'entrée triomphale de Jésus à Jérusalem. Le peuple l'acclamait avec des branches de palmier en criant « Hosanna ! »",
    "holidayHolyThursday": "Jeudi Saint",
    "holidayHolyThursdayDesc": "Le Jeudi Saint commémore le dernier repas de Jésus avec ses apôtres, lors duquel il institua l'Eucharistie et le sacerdoce. Il lava aussi les pieds de ses disciples.",
    "holidayGoodFriday": "Vendredi Saint",
    "holidayGoodFridayDesc": "Le Vendredi Saint est le jour de la crucifixion et de la mort de Jésus sur la croix. C'est un jour de jeûne et de recueillement où l'Église vénère la Croix du Sauveur.",
    "holidayHolySaturday": "Samedi Saint",
    "holidayHolySaturdayDesc": "Jour de silence et d'attente entre la mort et la résurrection du Christ. L'Église veille près du tombeau. La Vigile pascale, dans la nuit, célèbre la Résurrection.",
    "holidayEaster": "Pâques - Résurrection du Seigneur",
    "holidayEasterDesc": "Pâques est la plus grande fête chrétienne. Elle célèbre la résurrection de Jésus-Christ, vainqueur de la mort. C'est le fondement de notre foi et l'espérance de la vie éternelle.",
    "holidayEasterMonday": "Lundi de Pâques",
    "holidayEasterMondayDesc": "Le lundi de Pâques prolonge la joie pascale. L'Évangile raconte la rencontre des disciples d'Emmaüs avec Jésus ressuscité, qu'ils ont reconnu à la fraction du pain.",
    "holidayDivineMercy": "Dimanche de la Divine Miséricorde",
    "holidayDivineMercyDesc": "Institué par saint Jean-Paul II, ce dimanche célèbre la miséricorde infinie de Dieu. Jésus a confié ce message à sainte Faustine : « Jésus, j'ai confiance en Toi. »",
    "holidayAscension": "Ascension",
    "holidayAscensionDesc": "L'Ascension célèbre la montée de Jésus au Ciel, quarante jours après Pâques. Le Christ ressuscité rejoint son Père et nous ouvre le chemin de la vie éternelle.",
    "holidayPentecost": "Pentecôte",
    "holidayPentecostDesc": "La Pentecôte célèbre la descente de l'Esprit Saint sur les apôtres, cinquante jours après Pâques. C'est la naissance de l'Église. Les apôtres reçoivent la force d'annoncer l'Évangile.",
    "holidayPentecostMonday": "Lundi de Pentecôte",
    "holidayPentecostMondayDesc": "Le lundi de Pentecôte prolonge la fête de la Pentecôte et célèbre les dons de l'Esprit Saint répandus sur l'Église et sur chaque baptisé.",
    "holidayTrinity": "Sainte Trinité",
    "holidayTrinityDesc": "La fête de la Sainte Trinité célèbre le mystère central de la foi chrétienne : un seul Dieu en trois personnes égales et distinctes - le Père, le Fils et le Saint-Esprit.",
    "holidayCorpusChristi": "Fête-Dieu (Saint-Sacrement)",
    "holidayCorpusChristiDesc": "La Fête-Dieu célèbre la présence réelle de Jésus-Christ dans l'Eucharistie. Des processions solennelles portent l'hostie consacrée pour manifester la foi en ce mystère d'amour.",
    "holidaySacredHeart": "Sacré-Cœur de Jésus",
    "holidaySacredHeartDesc": "Cette fête célèbre l'amour infini du Christ pour l'humanité, symbolisé par son Cœur. Jésus a révélé son Cœur à sainte Marguerite-Marie : « Voici ce Cœur qui a tant aimé les hommes. »",
    "holidayChristKing": "Christ Roi de l'Univers",
    "holidayChristKingDesc": "Dernière fête de l'année liturgique, elle proclame la royauté universelle du Christ sur toute la création. Son règne est un règne d'amour, de justice et de paix.",
    "holidayAdvent": "Premier dimanche de l'Avent",
    "holidayAdventDesc": "Début de l'année liturgique et du temps de l'Avent, période de quatre semaines de préparation à Noël. L'Église attend la venue du Sauveur avec espérance."
}
