{
    "subtitle": "Calendario delle Feste Cristiane e Santi del Giorno",
    "saintOfDay": "Santo del giorno",
    "searchYear": "Cerca un anno",
    "yearPlaceholder": "Anno (-46 a 9999)",
    "tabHolidays": "Feste",
    "tabSaints": "Santi",
    "emptyHolidays": "Inserisci un anno per vedere le feste cristiane",
    "addToGoogle": "Aggiungi a Google Calendar",
    "legendMajor": "Festa maggiore",
    "legendMobile": "Festa mobile",
    "legendFixed": "Festa fissa",
    "legendToday": "Oggi",
    "legendSaint": "Santo del giorno",
    "footerTitle": "Calendario Cristiano",
    "legalNotice": "Note legali",
    "gdpr": "GDPR",
    "footerCompliance": "Conforme al GDPR (UE 2016/679) e alle leggi sulla privacy",
    "mon": "Lun",
    "tue": "Mar",
    "wed": "Mer",
    "thu": "Gio",
    "fri": "Ven",
    "sat": "Sab",
    "sun": "Dom",
    "months": ["Gennaio", "Febbraio", "Marzo", "Aprile", "Maggio", "Giugno", "Luglio", "Agosto", "Settembre", "Ottobre", "Novembre", "Dicembre"],
    "isLeapYear": "è bisestile",
    "isNotLeapYear": "non è bisestile",
    "days366": "366 giorni - Febbraio ha 29 giorni",
    "days365": "365 giorni - Febbraio ha 28 giorni",
    "impossible": "Impossibile andare",
    "beforeYear": "prima dell'anno 46 a.C.",
    "afterYear": "oltre l'anno 9999",
    "enterValidYear": "Inserisci un anno valido (-46 a 9999)",
    "skippedDay": "Giorno rimosso durante la riforma gregoriana",
    "churchCelebrates": "La Chiesa celebra",
    "eachDay": "Ogni giorno dell'anno è dedicato alla memoria di uno o più santi che hanno testimoniato la loro fede con la loro vita esemplare.",
    "donateBtn": "Dona",
    "donateTitle": "Donare alla chiesa",
    "donateDescription": "Il tuo sostegno aiuta a finanziare le attività parrocchiali, la manutenzione degli edifici e le opere caritative.",
    "donateLinkText": "Dona",
    "donateLinkUrl": "https://paypal.com",
    "close": "Chiudi",
    "flag": "🇮🇹",
    
    "calendarPreJulian": "Pre-Giuliano (Calendario romano)",
    "calendarJulian": "Giuliano",
    "calendarTransition": "Transizione Giuliano → Gregoriano",
    "calendarGregorianFirst": "Gregoriano (1° anno completo)",
    "calendarGregorian": "Gregoriano",
    
    "leapRuleRoman": "Sistema calendariale romano antico",
    "leapRuleJulian": "Bisestile se divisibile per 4",
    "leapRuleTransition": "Anno di transizione",
    "leapRuleGregorian": "Bisestile se divisibile per 4, tranne gli anni secolari non divisibili per 400",
    
    "descPreJulian": "Nel {year}, il calendario romano antico era in vigore. Il calendario Giuliano sarà introdotto nel 45 a.C.",
    "descJulianBC": "Nel {year}, il calendario Giuliano era in vigore. Introdotto da Giulio Cesare nel 45 a.C.",
    "descJulianAD": "Nel {year}, il calendario Giuliano era in vigore. Sarà riformato nel 1582.",
    "descTransition": "{year} è l'anno della riforma gregoriana! Papa Gregorio XIII ha soppresso 10 giorni: si è passati dal 4 ottobre al 15 ottobre 1582.",
    "descGregorianFirst": "{year} è il primo anno completo del calendario Gregoriano. La differenza con il calendario Giuliano era di 10 giorni a quell'epoca.",
    "descGregorian": "Nel {year}, il calendario Gregoriano è in vigore.",
    
    "easterGregorian": "Pasqua (Gregoriano)",
    "easterJulian": "Pasqua (Giuliano)",
    "easterDaysDiff": "+{days} giorni",
    
    "noHolidaysBeforeYear0": "Nessuna festa cristiana prima della nascita di Cristo (25 dicembre anno 0)",
    
    "legalAndGdpr": "Note legali e GDPR",
    "legalTitle": "Note Legali e GDPR",
    "legalSection1Title": "1. Editore del sito",
    "legalSection1Text1": "GigaFaith - Calendario Cristiano",
    "legalSection1Text2": "Applicazione web a scopo informativo ed educativo.",
    "legalSection2Title": "2. Hosting",
    "legalSection2Text": "Applicazione ospitata localmente / auto-ospitata.",
    "legalSection3Title": "3. Protezione dei dati personali (GDPR)",
    "legalSection3Intro": "In conformità al Regolamento Generale sulla Protezione dei Dati (GDPR - UE 2016/679):",
    "legalSection3Item1": "Dati raccolti: Nessun dato personale viene raccolto da questa applicazione.",
    "legalSection3Item2": "Cookie: Viene utilizzato solo un cookie tecnico per ricordare le preferenze del tema (chiaro/scuro). Questo cookie è strettamente necessario per il funzionamento del sito e non richiede consenso.",
    "legalSection3Item3": "LocalStorage: Il tema scelto viene memorizzato localmente nel browser.",
    "legalSection3Item4": "Trasferimento dati: Nessun trasferimento di dati a terzi.",
    "legalSection4Title": "4. I tuoi diritti (Articoli 15-22 GDPR)",
    "legalSection4Intro": "Hai i seguenti diritti:",
    "legalSection4Item1": "Diritto di accesso ai tuoi dati",
    "legalSection4Item2": "Diritto di rettifica",
    "legalSection4Item3": "Diritto alla cancellazione ('diritto all'oblio')",
    "legalSection4Item4": "Diritto alla limitazione del trattamento",
    "legalSection4Item5": "Diritto alla portabilità dei dati",
    "legalSection4Item6": "Diritto di opposizione",
    "legalSection4Note": "Nota: Questi diritti non si applicano qui poiché non vengono raccolti dati personali.",
    "legalSection5Title": "5. Proprietà intellettuale",
    "legalSection5Text": "Le informazioni sulle festività cristiane e i santi provengono dal dominio pubblico e dalla tradizione cattolica.",
    "legalSection6Title": "6. Legge applicabile",
    "legalSection6Intro": "Questo sito è soggetto al diritto europeo, tra cui:",
    "legalSection6Item1": "Regolamento Generale sulla Protezione dei Dati (UE) 2016/679",
    "legalSection6Item2": "Codice in materia di protezione dei dati personali (D.Lgs. 196/2003)",
    "legalSection6Item3": "D.Lgs. 101/2018",
    "legalSection7Title": "7. Contatto autorità di protezione",
    "legalSection7Intro": "Per qualsiasi domanda relativa alla protezione dei dati, puoi contattare:",
    "legalSection7Authority": "Garante per la Protezione dei Dati Personali",
    "legalSection7Address": "Piazza Venezia, 11 - 00187 Roma",
    "legalSection7Website": "www.garanteprivacy.it",
    "legalUnderstood": "Ho capito",

    "holidayMaryMotherOfGod": "Santa Maria, Madre di Dio",
    "holidayMaryMotherOfGodDesc": "Il primo giorno dell'anno, questa festa celebra la maternità divina di Maria. Lei è la madre di Gesù Cristo, il Figlio di Dio fatto uomo. Questa solennità è anche la Giornata Mondiale della Pace.",
    "holidayEpiphany": "Epifania",
    "holidayEpiphanyDesc": "L'Epifania celebra la manifestazione di Gesù ai Magi venuti dall'Oriente. Questi saggi, guidati da una stella, portarono al Bambino Gesù oro, incenso e mirra. Questa festa simbolizza la rivelazione di Dio a tutti i popoli.",
    "holidayPresentation": "Presentazione del Signore",
    "holidayPresentationDesc": "Quaranta giorni dopo Natale, questa festa commemora la presentazione di Gesù al Tempio di Gerusalemme da parte di Maria e Giuseppe, secondo la legge ebraica. È anche conosciuta come la Candelora.",
    "holidaySaintJoseph": "San Giuseppe",
    "holidaySaintJosephDesc": "Festa di San Giuseppe, sposo della Vergine Maria e padre putativo di Gesù. È il patrono dei lavoratori, dei padri di famiglia e della Chiesa Universale.",
    "holidayAnnunciation": "Annunciazione",
    "holidayAnnunciationDesc": "L'Annunciazione celebra l'annuncio fatto a Maria dall'Arcangelo Gabriele che sarebbe diventata la madre del Figlio di Dio. Maria rispose 'Sì' a Dio, rendendo possibile l'Incarnazione.",
    "holidayJohnBaptistBirth": "Natività di San Giovanni Battista",
    "holidayJohnBaptistBirthDesc": "Questa festa celebra la nascita di Giovanni Battista, il precursore di Cristo. Egli preparò la via del Signore e battezzò Gesù nel fiume Giordano.",
    "holidayPeterPaul": "Santi Pietro e Paolo",
    "holidayPeterPaulDesc": "Solennità che celebra i due pilastri della Chiesa: Pietro, il capo degli apostoli a cui Gesù affidò le chiavi del Regno, e Paolo, l'apostolo delle nazioni che evangelizzò il mondo pagano.",
    "holidayTransfiguration": "Trasfigurazione",
    "holidayTransfigurationDesc": "La Trasfigurazione commemora il momento in cui Gesù, sul monte Tabor, rivelò la sua gloria divina a Pietro, Giacomo e Giovanni. Il suo volto brillava come il sole.",
    "holidayAssumption": "Assunzione",
    "holidayAssumptionDesc": "L'Assunzione celebra l'ascesa della Vergine Maria al cielo con anima e corpo alla fine della sua vita terrena. Lei è stata la prima dei redenti a entrare nella gloria celeste.",
    "holidayMaryBirth": "Natività della Beata Vergine Maria",
    "holidayMaryBirthDesc": "Questa festa celebra la nascita di Maria, che sarebbe diventata la madre di Gesù. Nacque senza peccato originale, preparata da Dio per essere la madre del Salvatore.",
    "holidayHolyCross": "Esaltazione della Santa Croce",
    "holidayHolyCrossDesc": "Questa festa esalta la Santa Croce, strumento della nostra salvezza. Commemora la scoperta della Vera Croce da parte di Sant'Elena e la vittoria di Cristo sulla morte.",
    "holidayAllSaints": "Tutti i Santi",
    "holidayAllSaintsDesc": "Tutti i Santi è la festa di tutti i santi, conosciuti e sconosciuti, che sono in paradiso. Ci ricorda che siamo tutti chiamati alla santità e alla vita eterna con Dio.",
    "holidayAllSouls": "Commemorazione dei Fedeli Defunti",
    "holidayAllSoulsDesc": "Il giorno dopo Tutti i Santi, la Chiesa prega per tutti i fedeli defunti che sono in purgatorio, affinché siano purificati e possano entrare nella gioia del Cielo.",
    "holidayImmaculateConception": "Immacolata Concezione",
    "holidayImmaculateConceptionDesc": "Questa solennità celebra la concezione di Maria senza peccato originale. Dal primo istante della sua esistenza, Maria è stata preservata dal peccato per diventare la madre del Salvatore.",
    "holidayChristmas": "Natale - Natività del Signore",
    "holidayChristmasDesc": "Il Natale celebra la nascita di Gesù Cristo a Betlemme. Il Figlio di Dio si è fatto uomo per salvarci. È la festa dell'amore di Dio che viene ad abitare in mezzo a noi.",
    "holidaySaintStephen": "Santo Stefano",
    "holidaySaintStephenDesc": "Festa del primo martire cristiano. Stefano, diacono pieno di Spirito Santo, fu lapidato per la sua fede in Gesù Cristo. Perdonò i suoi carnefici come Cristo sulla croce.",
    "holidaySaintJohn": "San Giovanni Evangelista",
    "holidaySaintJohnDesc": "Festa dell'apostolo Giovanni, il discepolo che Gesù amava. È l'autore del quarto Vangelo, di tre epistole e dell'Apocalisse. È l'unico apostolo morto di vecchiaia.",
    "holidayHolyInnocents": "Santi Innocenti",
    "holidayHolyInnocentsDesc": "Questa festa commemora i bambini di Betlemme massacrati per ordine del re Erode, che cercava di uccidere il bambino Gesù. Sono considerati i primi martiri.",

    "holidayAshWednesday": "Mercoledì delle Ceneri",
    "holidayAshWednesdayDesc": "Inizio della Quaresima, periodo di 40 giorni di preparazione alla Pasqua. Le ceneri, imposte sulla fronte, ci ricordano la nostra condizione mortale e ci invitano alla conversione.",
    "holidayPalmSunday": "Domenica delle Palme",
    "holidayPalmSundayDesc": "Questa domenica apre la Settimana Santa e commemora l'ingresso trionfale di Gesù a Gerusalemme. Il popolo lo acclamava con rami di palma, gridando 'Osanna!'",
    "holidayHolyThursday": "Giovedì Santo",
    "holidayHolyThursdayDesc": "Il Giovedì Santo commemora l'ultima cena di Gesù con i suoi apostoli, durante la quale istituì l'Eucaristia e il sacerdozio. Lavò anche i piedi dei suoi discepoli.",
    "holidayGoodFriday": "Venerdì Santo",
    "holidayGoodFridayDesc": "Il Venerdì Santo è il giorno della crocifissione e morte di Gesù sulla croce. È un giorno di digiuno e preghiera in cui la Chiesa venera la Croce del Salvatore.",
    "holidayHolySaturday": "Sabato Santo",
    "holidayHolySaturdayDesc": "Giorno di silenzio e attesa tra la morte e la risurrezione di Cristo. La Chiesa veglia presso il sepolcro. La Veglia Pasquale, nella notte, celebra la Risurrezione.",
    "holidayEaster": "Pasqua - Risurrezione del Signore",
    "holidayEasterDesc": "La Pasqua è la più grande festa cristiana. Celebra la risurrezione di Gesù Cristo, vincitore della morte. È il fondamento della nostra fede e la speranza della vita eterna.",
    "holidayEasterMonday": "Lunedì di Pasqua",
    "holidayEasterMondayDesc": "Il Lunedì di Pasqua prolunga la gioia pasquale. Il Vangelo racconta l'incontro dei discepoli di Emmaus con Gesù risorto, che riconobbero nella frazione del pane.",
    "holidayDivineMercy": "Domenica della Divina Misericordia",
    "holidayDivineMercyDesc": "Istituita da San Giovanni Paolo II, questa domenica celebra l'infinita misericordia di Dio. Gesù affidò questo messaggio a Santa Faustina: 'Gesù, confido in Te.'",
    "holidayAscension": "Ascensione",
    "holidayAscensionDesc": "L'Ascensione celebra la salita di Gesù al Cielo, quaranta giorni dopo Pasqua. Cristo risorto raggiunge il Padre e ci apre la via alla vita eterna.",
    "holidayPentecost": "Pentecoste",
    "holidayPentecostDesc": "La Pentecoste celebra la discesa dello Spirito Santo sugli apostoli, cinquanta giorni dopo Pasqua. È la nascita della Chiesa. Gli apostoli ricevono la forza per annunciare il Vangelo.",
    "holidayPentecostMonday": "Lunedì di Pentecoste",
    "holidayPentecostMondayDesc": "Il Lunedì di Pentecoste prolunga la festa di Pentecoste e celebra i doni dello Spirito Santo effusi sulla Chiesa e su ogni battezzato.",
    "holidayTrinity": "Santissima Trinità",
    "holidayTrinityDesc": "La festa della Santissima Trinità celebra il mistero centrale della fede cristiana: un solo Dio in tre persone uguali e distinte - il Padre, il Figlio e lo Spirito Santo.",
    "holidayCorpusChristi": "Corpus Domini",
    "holidayCorpusChristiDesc": "Il Corpus Domini celebra la presenza reale di Gesù Cristo nell'Eucaristia. Processioni solenni portano l'ostia consacrata per manifestare la fede in questo mistero d'amore.",
    "holidaySacredHeart": "Sacro Cuore di Gesù",
    "holidaySacredHeartDesc": "Questa festa celebra l'amore infinito di Cristo per l'umanità, simboleggiato dal suo Cuore. Gesù rivelò il suo Cuore a Santa Margherita Maria: 'Ecco quel Cuore che ha tanto amato gli uomini.'",
    "holidayChristKing": "Cristo Re dell'Universo",
    "holidayChristKingDesc": "Ultima festa dell'anno liturgico, proclama la regalità universale di Cristo su tutta la creazione. Il suo regno è di amore, giustizia e pace.",
    "holidayAdvent": "Prima Domenica di Avvento",
    "holidayAdventDesc": "Inizio dell'anno liturgico e del tempo di Avvento, periodo di quattro settimane di preparazione al Natale. La Chiesa attende la venuta del Salvatore con speranza."
}
